MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_usart.h
/**
  ******************************************************************************
  * @file    stm32c5xx_hal_usart.h
  * @brief   Header file of USART HAL module.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef STM32C5XX_HAL_USART_H
#define STM32C5XX_HAL_USART_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32c5xx_hal_def.h"
#include "stm32c5xx_ll_usart.h"

/** @addtogroup STM32C5xx_HAL_Driver
  * @{
  */
#if defined(USART1) || defined(USART2) || defined(USART3) || defined(UART4) || defined(UART5) || defined(USART6) \
 || defined(UART7)

/** @defgroup USART USART
  * @{
  */

/** @defgroup USART_Exported_Types HAL USART Types
  * @{
  */
/**
  * @brief HAL USART Instance Definition.
  *
  */
typedef enum
{
  /*! Instance USART1 */
  HAL_USART1 = USART1_BASE,
  /*! Instance USART2 */
  HAL_USART2 = USART2_BASE,
#if defined(USART3)
  /*! Instance USART3 */
  HAL_USART3 = USART3_BASE,
#endif /* USART3 */
#if defined(USART6)
  /*! Instance USART6 */
  HAL_USART6 = USART6_BASE,
#endif /* USART6 */

} hal_usart_t;

/**
  * @brief HAL USART State Structure Definition.
  */
typedef enum
{
  /*! Peripheral is not initialized */
  HAL_USART_STATE_RESET                     = 0UL,
  /*! Peripheral is initialized but not configured */
  HAL_USART_STATE_INIT                      = (1UL << 31U),
  /*!  Peripheral is initialized and a global config is set */
  HAL_USART_STATE_IDLE                      = (1UL << 30U),
  /*! Peripheral Reception process is ongoing */
  HAL_USART_STATE_RX_ACTIVE                 = (1UL << 29U),
  /*! Peripheral Transmit process is ongoing */
  HAL_USART_STATE_TX_ACTIVE                 = (1UL << 28U),
  /*! Peripheral Transmit/Receive process is ongoing */
  HAL_USART_STATE_TX_RX_ACTIVE              = (1UL << 27U),
  /*! Peripheral process is aborting */
  HAL_USART_STATE_ABORT                     = (1UL << 26U),
} hal_usart_state_t;


/** @addtogroup USART_Basic_config USART Basic configuration Definition
  * @{
  */
/**
  * @brief HAL USART Word Length Definition.
  */
typedef enum
{
  /*! 7-bit long USART frame */
  HAL_USART_WORD_LENGTH_7_BIT               = LL_USART_DATAWIDTH_7_BIT,
  /*! 8-bit long USART frame */
  HAL_USART_WORD_LENGTH_8_BIT               = LL_USART_DATAWIDTH_8_BIT,
  /*! 9-bit long USART frame */
  HAL_USART_WORD_LENGTH_9_BIT               = LL_USART_DATAWIDTH_9_BIT,
} hal_usart_word_length_t;

/**
  * @brief HAL USART Stop Bits Definition.
  */
typedef enum
{
  /*! USART frame with 0.5 stop bit */
  HAL_USART_STOP_BIT_0_5                    = LL_USART_STOP_BIT_0_5,
  /*! USART frame with 1 stop bit */
  HAL_USART_STOP_BIT_1                      = LL_USART_STOP_BIT_1,
  /*! USART frame with 1.5 stop bits */
  HAL_USART_STOP_BIT_1_5                    = LL_USART_STOP_BIT_1_5,
  /*! USART frame with 2 stop bits */
  HAL_USART_STOP_BIT_2                      = LL_USART_STOP_BIT_2,
} hal_usart_stop_bits_t;

/**
  * @brief HAL USART Parity Definition.
  * @note When parity is enabled, the computed parity is inserted
          at the MSB position of the transmitted data (9th bit when
          the word length is set to 9 data bits; 8th bit when the
          word length is set to 8 data bits).
  */
typedef enum
{
  /*! No parity */
  HAL_USART_PARITY_NONE                     = LL_USART_PARITY_NONE,
  /*! Even parity */
  HAL_USART_PARITY_EVEN                     = LL_USART_PARITY_EVEN,
  /*! Odd parity */
  HAL_USART_PARITY_ODD                      = LL_USART_PARITY_ODD,
} hal_usart_parity_t;

/**
  * @brief HAL USART Direction Definition.
  */
typedef enum
{
  /*! RX mode */
  HAL_USART_DIRECTION_RX                    = LL_USART_DIRECTION_RX,
  /*! TX mode */
  HAL_USART_DIRECTION_TX                    = LL_USART_DIRECTION_TX,
  /*! RX and TX mode */
  HAL_USART_DIRECTION_TX_RX                 = LL_USART_DIRECTION_TX_RX,
} hal_usart_direction_t;

/**
  * @brief HAL USART Clock Prescaler Definition.
  */
typedef enum
{
  /*! fclk_pres = fclk */
  HAL_USART_PRESCALER_DIV1                  = LL_USART_PRESCALER_DIV1,
  /*! fclk_pres = fclk/2 */
  HAL_USART_PRESCALER_DIV2                  = LL_USART_PRESCALER_DIV2,
  /*! fclk_pres = fclk/4 */
  HAL_USART_PRESCALER_DIV4                  = LL_USART_PRESCALER_DIV4,
  /*! fclk_pres = fclk/6 */
  HAL_USART_PRESCALER_DIV6                  = LL_USART_PRESCALER_DIV6,
  /*! fclk_pres = fclk/8 */
  HAL_USART_PRESCALER_DIV8                  = LL_USART_PRESCALER_DIV8,
  /*! fclk_pres = fclk/10 */
  HAL_USART_PRESCALER_DIV10                 = LL_USART_PRESCALER_DIV10,
  /*! fclk_pres = fclk/12 */
  HAL_USART_PRESCALER_DIV12                 = LL_USART_PRESCALER_DIV12,
  /*! fclk_pres = fclk/16 */
  HAL_USART_PRESCALER_DIV16                 = LL_USART_PRESCALER_DIV16,
  /*! fclk_pres = fclk/32 */
  HAL_USART_PRESCALER_DIV32                 = LL_USART_PRESCALER_DIV32,
  /*! fclk_pres = fclk/64 */
  HAL_USART_PRESCALER_DIV64                 = LL_USART_PRESCALER_DIV64,
  /*! fclk_pres = fclk/128 */
  HAL_USART_PRESCALER_DIV128                = LL_USART_PRESCALER_DIV128,
  /*! fclk_pres = fclk/256 */
  HAL_USART_PRESCALER_DIV256                = LL_USART_PRESCALER_DIV256,
} hal_usart_prescaler_t;


/**
  *  @brief HAL USART Clock Polarity Definition
  */
typedef enum
{
  /*! Steady low value on SCLK pin outside transmission window */
  HAL_USART_CLOCK_POLARITY_LOW              = LL_USART_CLOCK_POLARITY_LOW,
  /*! Steady high value on SCLK pin outside transmission window */
  HAL_USART_CLOCK_POLARITY_HIGH             = LL_USART_CLOCK_POLARITY_HIGH,
} hal_usart_clock_polarity_t;

/**
  *  @brief HAL USART Clock Phase Definition
  */
typedef enum
{
  /*! USART frame phase on first clock transition  */
  HAL_USART_CLOCK_PHASE_1_EDGE              = LL_USART_CLOCK_PHASE_1_EDGE,
  /*! USART frame phase on second clock transition */
  HAL_USART_CLOCK_PHASE_2_EDGE              = LL_USART_CLOCK_PHASE_2_EDGE,
} hal_usart_clock_phase_t;

/**
  *  @brief HAL USART Clock Last Bit Status Definition
  */
typedef enum
{
  /*! USART frame last data bit clock pulse not output to SCLK pin */
  HAL_USART_CLOCK_LAST_BIT_DISABLED         = LL_USART_LASTCLKPULSE_DISABLED,
  /*! USART frame last data bit clock pulse output to SCLK pin     */
  HAL_USART_CLOCK_LAST_BIT_ENABLED          = LL_USART_LASTCLKPULSE_ENABLED,
} hal_usart_clock_last_bit_state_t;

/**
  * @}
  */

#if defined(USE_HAL_USART_FIFO) && (USE_HAL_USART_FIFO == 1)
/** @defgroup USART_FIFO_Mode USART FIFO Mode Definition
  * @{
  */

/**
  * @brief HAL USART FIFO Threshold Definition.
  */
typedef enum
{
  /*! FIFO reaches 1/8 of its depth */
  HAL_USART_FIFO_THRESHOLD_1_8              = LL_USART_FIFO_THRESHOLD_1_8,
  /*! FIFO reaches 1/4 of its depth */
  HAL_USART_FIFO_THRESHOLD_1_4              = LL_USART_FIFO_THRESHOLD_1_4,
  /*! FIFO reaches 1/2 of its depth */
  HAL_USART_FIFO_THRESHOLD_1_2              = LL_USART_FIFO_THRESHOLD_1_2,
  /*! FIFO reaches 3/4 of its depth */
  HAL_USART_FIFO_THRESHOLD_3_4              = LL_USART_FIFO_THRESHOLD_3_4,
  /*! FIFO reaches 7/8 of its depth */
  HAL_USART_FIFO_THRESHOLD_7_8              = LL_USART_FIFO_THRESHOLD_7_8,
  /*! FIFO reaches 8/8 of its depth */
  HAL_USART_FIFO_THRESHOLD_8_8              = LL_USART_FIFO_THRESHOLD_8_8,
} hal_usart_fifo_threshold_t;

/**
  * @brief HAL USART FIFO Mode Status Definition.
  */
typedef enum
{
  /*! USART FIFO Mode is disabled */
  HAL_USART_FIFO_MODE_DISABLED              = 0U,
  /*! USART FIFO Mode is enabled */
  HAL_USART_FIFO_MODE_ENABLED               = 1U,
} hal_usart_fifo_mode_status_t;
/**
  * @}
  */
#endif /* USE_HAL_USART_FIFO */

/**
  * @brief HAL USART Request Definition.
  */
typedef enum
{
  /*! Receive Data flush Request */
  HAL_USART_REQUEST_RX_DATA_FLUSH           = LL_USART_REQUEST_RX_DATA_FLUSH,
  /*! Transmit data flush Request */
  HAL_USART_REQUEST_TX_DATA_FLUSH           = LL_USART_REQUEST_TX_DATA_FLUSH,
} hal_usart_request_t;

/**
  * @brief HAL USART Master/Slave Mode Definition.
  */
typedef enum
{
  /*! USART Master mode is configured */
  HAL_USART_MODE_MASTER    = 0U,
  /*! USART Slave mode is configured */
  HAL_USART_MODE_SLAVE     = 1U,
} hal_usart_mode_t;

/**
  * @brief HAL USART Slave Select Configuration Definition.
  */
typedef enum
{
  /*! USART NSS PIN is ignored to select the slave */
  HAL_USART_SLAVE_SELECT_PIN_IGNORED = LL_USART_NSS_IGNORED,
  /*! USART NSS PIN is used to select the slave */
  HAL_USART_SLAVE_SELECT_PIN_USED    = LL_USART_NSS_USED,
} hal_usart_slave_select_config_t;

/*! HAL USART handler type */
typedef struct hal_usart_handle_s hal_usart_handle_t;

