MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_usart.h
#if defined(USE_HAL_USART_REGISTER_CALLBACKS) && (USE_HAL_USART_REGISTER_CALLBACKS == 1)
/*! HAL USART Generic USART callback Type */
typedef void (* hal_usart_cb_t)(hal_usart_handle_t *husart);
#endif  /* USE_HAL_USART_REGISTER_CALLBACKS */

/**
  * @brief HAL USART Handle Structure Type.
  */
struct hal_usart_handle_s
{
  /*! Peripheral instance        */
  hal_usart_t instance;

  /*! Pointer to USART Tx transfer Buffer */
  const uint8_t *p_tx_buff;

  /*! USART Tx Transfer size              */
  volatile uint32_t tx_xfer_size;

  /*! USART Tx Transfer Counter           */
  volatile uint32_t tx_xfer_count;

  /*! Pointer to USART Rx transfer Buffer */
  uint8_t *p_rx_buff;

  /*! USART Rx Transfer size              */
  volatile uint32_t rx_xfer_size;

  /*! USART Rx Transfer Counter           */
  volatile uint32_t rx_xfer_count;

  /*! USART Rx RDR register mask          */
  volatile uint16_t rdr_register_mask;

#if defined(USE_HAL_USART_FIFO) && (USE_HAL_USART_FIFO == 1)
  /*! Specifies if the FIFO mode is being used.*/
  hal_usart_fifo_mode_status_t fifo_mode;

  /*! Number of data to process during RX ISR execution */
  uint16_t nb_rx_data_to_process;

  /*! Number of data to process during TX ISR execution */
  uint16_t nb_tx_data_to_process;

#endif /* USE_HAL_USART_FIFO */
  /*! USART Master/Slave mode          */
  hal_usart_mode_t usart_mode;

  /*! Function pointer on Rx IRQ handler */
  void (*p_rx_isr)(struct hal_usart_handle_s *husart);

  /*! Function pointer on Tx IRQ handler */
  void (*p_tx_isr)(struct hal_usart_handle_s *husart);

#if defined (USE_HAL_USART_DMA) && (USE_HAL_USART_DMA == 1)
  /*! USART Tx DMA Handle parameters      */
  hal_dma_handle_t *hdma_tx;

  /*! USART Rx DMA Handle parameters      */
  hal_dma_handle_t *hdma_rx;

#endif /* USE_HAL_USART_DMA */
  /*! USART state information related to global Handle management */
  volatile hal_usart_state_t global_state;

#if defined(USE_HAL_USART_REGISTER_CALLBACKS) && (USE_HAL_USART_REGISTER_CALLBACKS == 1)
  /*! USART Tx Half Complete Callback        */
  hal_usart_cb_t p_tx_half_cplt_callback;

  /*! USART Tx Complete Callback             */
  hal_usart_cb_t p_tx_cplt_callback;

  /*! USART Rx Half Complete Callback        */
  hal_usart_cb_t p_rx_half_cplt_callback;

  /*! USART Rx Complete Callback             */
  hal_usart_cb_t p_rx_cplt_callback;

  /*! USART Tx/Rx Complete Callback          */
  hal_usart_cb_t p_tx_rx_cplt_callback;

  /*! USART Error Callback                   */
  hal_usart_cb_t p_error_callback;

  /*! USART Abort Complete Callback          */
  hal_usart_cb_t p_abort_cplt_callback;

#if defined(USE_HAL_USART_FIFO) && (USE_HAL_USART_FIFO == 1)
  /*! USART Rx FIFO Full Callback            */
  hal_usart_cb_t p_rx_fifo_full_callback;

  /*! USART Tx FIFO Empty Callback           */
  hal_usart_cb_t p_tx_fifo_empty_callback;

#endif /* USE_HAL_USART_FIFO */

#endif  /* USE_HAL_USART_REGISTER_CALLBACKS */

#if defined(USE_HAL_MUTEX) && (USE_HAL_MUTEX == 1)
  /*! USART OS semaphore */
  hal_os_semaphore_t semaphore;

#endif /* USE_HAL_MUTEX  */

#if defined (USE_HAL_USART_USER_DATA) && (USE_HAL_USART_USER_DATA == 1)
  /*! User data pointer */
  const void *p_user_data;

#endif /* USE_HAL_USART_USER_DATA */

#if defined (USE_HAL_USART_GET_LAST_ERRORS) && (USE_HAL_USART_GET_LAST_ERRORS == 1)
  /*! Last error codes on reception side */
  volatile uint32_t last_error_codes;

#endif /* USE_HAL_USART_GET_LAST_ERRORS */
};


/** @addtogroup USART_Basic_config
  * @{
  */
/**
  * @brief HAL USART Global Config Structure Type.
  */
typedef struct
{
  /*! This member configures the USART communication baud rate.
      The baud rate register is computed using the following formula:
              Baud Rate Register[15:4] = ((2 * hal_usart_config_t->clock_prescaler) /
              ((hal_usart_config_t->baud_rate)))[15:4]
              Baud Rate Register[3] =  0
              Baud Rate Register[2:0] =  (((2 * hal_usart_config_t->clock_prescaler) /
              ((hal_usart_config_t->baud_rate)))[3:0]) >> 1
            where usart_ker_ck_pres is the USART input clock divided by a prescaler */
  uint32_t baud_rate;
  /*! Specifies the prescaler value used to divide the USART clock source. */
  hal_usart_prescaler_t clock_prescaler;

  /*! Specifies the number of data bits transmitted or received in a frame.*/
  hal_usart_word_length_t word_length;

  /*! Specifies the number of stop bits transmitted.*/
  hal_usart_stop_bits_t stop_bits;

  /*! Specifies the parity mode. */
  hal_usart_parity_t parity;

  /*! Specifies the process direction, receive and/or transmit. */
  hal_usart_direction_t direction;

  /*! Specifies the clock polarity. */
  hal_usart_clock_polarity_t clock_polarity;

  /*! Specifies the clock phase. */
  hal_usart_clock_phase_t clock_phase;

  /*! Specifies the clock last bit enabling. */
  hal_usart_clock_last_bit_state_t clock_last_bit;

  /*! Specifies the Mode (Master or Slave), by default configured in Master Mode. */
  hal_usart_mode_t mode;
} hal_usart_config_t;
/**
  * @}
  */
/**
  * @}
  */

/* Exported Constants --------------------------------------------------------*/
/** @defgroup USART_Exported_Constants HAL USART Constants
  * @{
  */
/** @defgroup USART_Error_Codes USART Error Codes
  * @{
  */
/*! No error */
#define HAL_USART_ERROR_NONE     (0UL)

/*! Parity error on RX */
#define HAL_USART_RECEIVE_ERROR_PE       (0x1UL << 0)

/*! Noise error on RX */
#define HAL_USART_RECEIVE_ERROR_NE       (0x1UL << 1U)

/*! Frame error on RX */
#define HAL_USART_RECEIVE_ERROR_FE       (0x1UL << 2U)

/*! Overrun error on RX */
#define HAL_USART_RECEIVE_ERROR_ORE      (0x1UL << 3U)

#if defined (USE_HAL_USART_DMA) && (USE_HAL_USART_DMA == 1U)
/*! DMA transfer error on RX */
#define HAL_USART_RECEIVE_ERROR_DMA      (0x1UL << 4U)
#endif /* USE_HAL_USART_DMA */

/*! Receiver Timeout error on RX */
#define HAL_USART_RECEIVE_ERROR_RTO      (0x1UL << 5U)

#if defined (USE_HAL_USART_DMA) && (USE_HAL_USART_DMA == 1U)
/*! DMA transfer error on TX */
#define HAL_USART_TRANSMIT_ERROR_DMA     (0x1UL << 16U)
#endif /* USE_HAL_USART_DMA */

