MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_usart.h
/*! Under Run error on Tx */
#define HAL_USART_TRANSMIT_ERROR_UDR     (0x1UL << 17U)
/**
  * @}
  */


/** @defgroup USART_Optional_Interrupts USART Optional Interrupts
  * @{
  */

/** @defgroup USART_Transmit_IT_Optional_Interrupts USART Optional Interrupts for Transmit IT process
  * @{
  */
/*! No Optional IT for Transmit IT based process */
#define HAL_USART_OPT_TX_IT_NONE             0U

#if defined(USE_HAL_USART_FIFO) && (USE_HAL_USART_FIFO == 1)
/*! Activate FIFO_EMPTY Optional IT for Transmit IT based process */
#define HAL_USART_OPT_TX_IT_FIFO_EMPTY       (1UL << 31U)

/*! Activate default Optional IT for Transmit IT based process */
#define HAL_USART_OPT_TX_IT_DEFAULT          (HAL_USART_OPT_TX_IT_FIFO_EMPTY)
#endif /* USE_HAL_USART_FIFO */
/**
  * @}
  */
#if defined(USE_HAL_USART_DMA) && (USE_HAL_USART_DMA == 1U)

/** @defgroup USART_Transmit_DMA_Optional_Interrupts USART Optional Interrupts for Transmit DMA process
  * @{
  */
/*! No Optional IT for Transmit DMA based process */
#define HAL_USART_OPT_DMA_TX_IT_NONE         0U

/*! Activate HALF_TRANSFER Optional IT for Transmit DMA based process */
#define HAL_USART_OPT_DMA_TX_IT_HT           (HAL_DMA_OPT_IT_HT)

/*! Activate default Optional IT for Transmit DMA based process */
#define HAL_USART_OPT_DMA_TX_IT_DEFAULT      (HAL_USART_OPT_DMA_TX_IT_HT)

#if defined(USE_HAL_DMA_LINKEDLIST) && (USE_HAL_DMA_LINKEDLIST == 1)
/*! Activate DMA SILENT MODE for Transmit DMA based process */
#define HAL_USART_OPT_DMA_TX_IT_SILENT       (HAL_DMA_OPT_IT_SILENT)
#endif /* USE_HAL_DMA_LINKEDLIST */
/**
  * @}
  */
#endif /* USE_HAL_USART_DMA */

/** @defgroup USART_Receive_IT_Optional_Interrupts USART Optional Interrupts for Receive IT process
  * @{
  */
/*! No Optional IT for Receive IT based process */
#define HAL_USART_OPT_RX_IT_NONE             0U

#if defined(USE_HAL_USART_FIFO) && (USE_HAL_USART_FIFO == 1)
/*! Activate FIFO_FULL Optional IT for Receive IT based process */
#define HAL_USART_OPT_RX_IT_FIFO_FULL        (1UL << 29U)

/*! Activate default Optional IT for Receive IT based process */
#define HAL_USART_OPT_RX_IT_DEFAULT          (HAL_USART_OPT_RX_IT_FIFO_FULL)
#endif /* USE_HAL_USART_FIFO */
/**
  * @}
  */

#if defined(USE_HAL_USART_DMA) && (USE_HAL_USART_DMA == 1U)

/** @defgroup USART_Receive_DMA_Optional_Interrupts USART Optional Interrupts for Receive DMA process
  * @{
  */
/*! No Optional IT for Receive DMA based process */
#define HAL_USART_OPT_DMA_RX_IT_NONE         0U

/*! Activate HALF_TRANSFER Optional IT for Receive DMA based process */
#define HAL_USART_OPT_DMA_RX_IT_HT           (HAL_DMA_OPT_IT_HT)

/*! Activate default Optional IT for Receive DMA based process */
#define HAL_USART_OPT_DMA_RX_IT_DEFAULT      (HAL_USART_OPT_DMA_RX_IT_HT)

#if defined(USE_HAL_DMA_LINKEDLIST) && (USE_HAL_DMA_LINKEDLIST == 1)
/*! Activate DMA SILENT MODE for Receive DMA based process */
#define HAL_USART_OPT_DMA_RX_IT_SILENT       (HAL_DMA_OPT_IT_SILENT)
#endif /* USE_HAL_DMA_LINKEDLIST */
/**
  * @}
  */
#endif /* USE_HAL_USART_DMA */


/** @defgroup USART_TransmitReceive_IT_Optional_Interrupts USART Optional Interrupts for TransmitReceive IT process
  * @{
  */
/*! No Optional IT for TransmitReceive IT based process */
#define HAL_USART_OPT_TXRX_IT_NONE           0U

#if defined(USE_HAL_USART_FIFO) && (USE_HAL_USART_FIFO == 1)
/*! Activate FIFO_EMPTY Optional IT for TransmitReceive IT based process */
#define HAL_USART_OPT_TXRX_TX_IT_FIFO_EMPTY  (1UL << 27U)

/*! Activate FIFO_FULL Optional IT for TransmitReceive IT based process */
#define HAL_USART_OPT_TXRX_RX_IT_FIFO_FULL   (1UL << 26U)

/*! Activate default Optional IT for TransmitReceive IT based process */
#define HAL_USART_OPT_TXRX_IT_DEFAULT        (HAL_USART_OPT_TXRX_TX_IT_FIFO_EMPTY | HAL_USART_OPT_TXRX_RX_IT_FIFO_FULL)
#endif /* USE_HAL_USART_FIFO */
/**
  * @}
  */


#if defined(USE_HAL_USART_DMA) && (USE_HAL_USART_DMA == 1U)

/** @defgroup USART_TransmitReceive_DMA_Optional_Interrupts USART Optional Interrupts for TransmitReceive DMA process
  * @{
  */
/*! No Optional IT for TransmitReceive DMA based process */
#define HAL_USART_OPT_DMA_TXRX_IT_NONE       0U

/*! Activate HALF_TRANSFER on TX Optional IT for TransmitReceive DMA based process */
#define HAL_USART_OPT_DMA_TXRX_TX_IT_HT      (HAL_DMA_OPT_IT_HT)

/*! Activate HALF_TRANSFER on RX Optional IT for TransmitReceive DMA based process */
#define HAL_USART_OPT_DMA_TXRX_RX_IT_HT      (HAL_DMA_OPT_IT_HT)

/*! Activate default Optional IT for TransmitReceive DMA based process */
#define HAL_USART_OPT_DMA_TXRX_IT_DEFAULT    (HAL_USART_OPT_DMA_TXRX_TX_IT_HT | HAL_USART_OPT_DMA_TXRX_RX_IT_HT)

#if defined(USE_HAL_DMA_LINKEDLIST) && (USE_HAL_DMA_LINKEDLIST == 1)
/*! Activate DMA SILENT MODE on for TransmitReceive DMA based process */
#define HAL_USART_OPT_DMA_TXRX_IT_SILENT     (HAL_DMA_OPT_IT_SILENT)
#endif /* USE_HAL_DMA_LINKEDLIST */
/**
  * @}
  */
#endif /* USE_HAL_USART_DMA */


/**
  * @}
  */

/**
  * @}
  */
/* Exported functions --------------------------------------------------------*/
/** @defgroup USART_Exported_Functions HAL USART Functions
  * @{
  */

/** @defgroup USART_Exported_Functions_Group1 Initialization and deinitialization functions
  * @{
  */
hal_status_t HAL_USART_Init(hal_usart_handle_t *husart, hal_usart_t instance);
void HAL_USART_DeInit(hal_usart_handle_t *husart);
/**
  * @}
  */

/** @defgroup USART_Exported_Functions_Group2 Basic configuration functions
  * @{
  */
hal_status_t HAL_USART_SetConfig(hal_usart_handle_t *husart, const hal_usart_config_t *p_config);
void HAL_USART_GetConfig(const hal_usart_handle_t *husart, hal_usart_config_t *p_config);

hal_status_t HAL_USART_SetWordLength(const hal_usart_handle_t *husart, hal_usart_word_length_t word_length);
hal_usart_word_length_t HAL_USART_GetWordLength(const hal_usart_handle_t *husart);

hal_status_t HAL_USART_SetParity(const hal_usart_handle_t *husart, hal_usart_parity_t parity);
hal_usart_parity_t HAL_USART_GetParity(const hal_usart_handle_t *husart);

hal_status_t HAL_USART_SetStopBits(const hal_usart_handle_t *husart, hal_usart_stop_bits_t stop_bits);
hal_usart_stop_bits_t HAL_USART_GetStopBits(const hal_usart_handle_t *husart);

