MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_usart.h
hal_status_t HAL_USART_SetXferDirection(const hal_usart_handle_t *husart, hal_usart_direction_t xfer_direction);
hal_usart_direction_t HAL_USART_GetXferDirection(const hal_usart_handle_t *husart);

hal_status_t HAL_USART_SetClockPolarity(const hal_usart_handle_t *husart, hal_usart_clock_polarity_t clock_polarity);
hal_usart_clock_polarity_t HAL_USART_GetClockPolarity(const hal_usart_handle_t *husart);

hal_status_t HAL_USART_SetClockPhase(const hal_usart_handle_t *husart, hal_usart_clock_phase_t clock_phase);
hal_usart_clock_phase_t HAL_USART_GetClockPhase(const hal_usart_handle_t *husart);

hal_status_t HAL_USART_SetLastBitClockPulse(const hal_usart_handle_t *husart,
                                            hal_usart_clock_last_bit_state_t clock_last_bit);
hal_usart_clock_last_bit_state_t HAL_USART_GetLastBitClockPulse(const hal_usart_handle_t *husart);

hal_status_t HAL_USART_SetBaudRate(const hal_usart_handle_t *husart, uint32_t baud_rate);
uint32_t HAL_USART_GetBaudRate(const hal_usart_handle_t *husart);

hal_status_t HAL_USART_SetMode(hal_usart_handle_t *husart, hal_usart_mode_t mode);
hal_usart_mode_t HAL_USART_GetMode(const hal_usart_handle_t *husart);
/**
  * @}
  */

#if defined(USE_HAL_USART_FIFO) && (USE_HAL_USART_FIFO == 1)
/** @defgroup USART_Exported_Functions_Group3 FIFO Configuration functions
  * @{
  */
hal_status_t HAL_USART_EnableFifoMode(hal_usart_handle_t *husart);
hal_status_t HAL_USART_DisableFifoMode(hal_usart_handle_t *husart);
hal_usart_fifo_mode_status_t HAL_USART_IsEnabledFifoMode(const hal_usart_handle_t *husart);

hal_status_t HAL_USART_SetTxFifoThreshold(hal_usart_handle_t *husart, hal_usart_fifo_threshold_t tx_fifo_threshold);
hal_usart_fifo_threshold_t HAL_USART_GetTxFifoThreshold(const hal_usart_handle_t *husart);
hal_status_t HAL_USART_SetRxFifoThreshold(hal_usart_handle_t *husart, hal_usart_fifo_threshold_t rx_fifo_threshold);
hal_usart_fifo_threshold_t HAL_USART_GetRxFifoThreshold(const hal_usart_handle_t *husart);
/**
  * @}
  */
#endif /* USE_HAL_USART_FIFO */


/** @defgroup USART_Exported_Functions_Group5 Advanced configuration functions
  * @{
  */

hal_status_t HAL_USART_SetSlaveSelect(const hal_usart_handle_t *husart, hal_usart_slave_select_config_t slave_select);
hal_usart_slave_select_config_t HAL_USART_GetSlaveSelect(const hal_usart_handle_t *husart);

/**
  * @}
  */
/** @defgroup USART_Exported_Functions_Group6 DMA Configuration functions
  * @{
  */
#if defined (USE_HAL_USART_DMA) && (USE_HAL_USART_DMA == 1)
hal_status_t HAL_USART_SetTxDMA(hal_usart_handle_t *husart, hal_dma_handle_t *hdma_tx);
hal_status_t HAL_USART_SetRxDMA(hal_usart_handle_t *husart, hal_dma_handle_t *hdma_rx);
#endif /* USE_HAL_USART_DMA */

/**
  * @}
  */

/** @defgroup USART_Exported_Functions_Group7 Callbacks Register functions
  * @{
  */
#if defined(USE_HAL_USART_REGISTER_CALLBACKS) && (USE_HAL_USART_REGISTER_CALLBACKS == 1)

hal_status_t HAL_USART_RegisterTxHalfCpltCallback(hal_usart_handle_t *husart, hal_usart_cb_t p_callback);
hal_status_t HAL_USART_RegisterTxCpltCallback(hal_usart_handle_t *husart, hal_usart_cb_t p_callback);
hal_status_t HAL_USART_RegisterRxHalfCpltCallback(hal_usart_handle_t *husart, hal_usart_cb_t p_callback);
hal_status_t HAL_USART_RegisterRxCpltCallback(hal_usart_handle_t *husart, hal_usart_cb_t p_callback);
hal_status_t HAL_USART_RegisterTxRxCpltCallback(hal_usart_handle_t *husart, hal_usart_cb_t p_callback);
hal_status_t HAL_USART_RegisterErrorCallback(hal_usart_handle_t *husart, hal_usart_cb_t p_callback);
hal_status_t HAL_USART_RegisterAbortCpltCallback(hal_usart_handle_t *husart, hal_usart_cb_t p_callback);

#if defined(USE_HAL_USART_FIFO) && (USE_HAL_USART_FIFO == 1)
hal_status_t HAL_USART_RegisterRxFifoFullCallback(hal_usart_handle_t *husart, hal_usart_cb_t p_callback);
hal_status_t HAL_USART_RegisterTxFifoEmptyCallback(hal_usart_handle_t *husart, hal_usart_cb_t p_callback);
#endif /* USE_HAL_USART_FIFO */
#endif /* USE_HAL_USART_REGISTER_CALLBACKS */

/**
  * @}
  */

/** @defgroup USART_Exported_Functions_Group8 IO operation functions
  * @{
  */

hal_status_t HAL_USART_Transmit(hal_usart_handle_t *husart, const void *p_data, uint32_t size_byte,
                                uint32_t timeout_ms);
hal_status_t HAL_USART_Receive(hal_usart_handle_t *husart, void *p_data, uint32_t size_byte, uint32_t timeout_ms);
hal_status_t HAL_USART_TransmitReceive(hal_usart_handle_t *husart, const void *p_tx_data, void *p_rx_data,
                                       uint32_t size_byte, uint32_t timeout_ms);

hal_status_t HAL_USART_Transmit_IT(hal_usart_handle_t *husart, const void *p_data, uint32_t size_byte);
hal_status_t HAL_USART_Receive_IT(hal_usart_handle_t *husart, void *p_data, uint32_t size_byte);
hal_status_t HAL_USART_TransmitReceive_IT(hal_usart_handle_t *husart, const void *p_tx_data, void *p_rx_data,
                                          uint32_t size_byte);

#if defined(USE_HAL_USART_FIFO) && (USE_HAL_USART_FIFO == 1)
hal_status_t HAL_USART_Transmit_IT_Opt(hal_usart_handle_t *husart, const void *p_data, uint32_t size_byte,
                                       uint32_t interrupts);
hal_status_t HAL_USART_Receive_IT_Opt(hal_usart_handle_t *husart, void *p_data, uint32_t size_byte,
                                      uint32_t interrupts);
hal_status_t HAL_USART_TransmitReceive_IT_Opt(hal_usart_handle_t *husart, const void *p_tx_data, void *p_rx_data,
                                              uint32_t size_byte, uint32_t interrupts);
#endif /* USE_HAL_USART_FIFO */
#if defined (USE_HAL_USART_DMA) && (USE_HAL_USART_DMA == 1)
hal_status_t HAL_USART_Transmit_DMA(hal_usart_handle_t *husart, const void *p_data, uint32_t size_byte);
hal_status_t HAL_USART_Receive_DMA(hal_usart_handle_t *husart, void *p_data, uint32_t size_byte);
hal_status_t HAL_USART_TransmitReceive_DMA(hal_usart_handle_t *husart, const void *p_tx_data, void *p_rx_data,
                                           uint32_t size_byte);

hal_status_t HAL_USART_Transmit_DMA_Opt(hal_usart_handle_t *husart, const void *p_data, uint32_t size_byte,
                                        uint32_t interrupts);
hal_status_t HAL_USART_Receive_DMA_Opt(hal_usart_handle_t *husart, void *p_data, uint32_t size_byte,
                                       uint32_t interrupts);
hal_status_t HAL_USART_TransmitReceive_DMA_Opt(hal_usart_handle_t *husart, const void *p_tx_data, void *p_rx_data,
                                               uint32_t size_byte, uint32_t interrupts);

hal_status_t HAL_USART_Pause_DMA(hal_usart_handle_t *husart);
hal_status_t HAL_USART_Resume_DMA(hal_usart_handle_t *husart);

#endif /* USE_HAL_USART_DMA */

/* Transfer Abort functions */
hal_status_t HAL_USART_Abort(hal_usart_handle_t *husart);
hal_status_t HAL_USART_Abort_IT(hal_usart_handle_t *husart);

hal_status_t HAL_USART_SendRequest(hal_usart_handle_t *husart, hal_usart_request_t request);
/**
  * @}
  */


/** @defgroup USART_Exported_Functions_Group9 Peripheral State and Error functions
  * @{
  */

/* Peripheral State and Errors functions  **************************************************/
hal_usart_state_t HAL_USART_GetState(const hal_usart_handle_t *husart);
uint32_t HAL_USART_GetClockFreq(const hal_usart_handle_t *husart);

#if defined (USE_HAL_USART_GET_LAST_ERRORS) && (USE_HAL_USART_GET_LAST_ERRORS == 1)
uint32_t HAL_USART_GetLastErrorCodes(const hal_usart_handle_t *husart);
#endif /* USE_HAL_USART_GET_LAST_ERRORS */

/**
  * @}
  */

#if defined(USE_HAL_MUTEX) && (USE_HAL_MUTEX == 1)
/** @defgroup USART_Exported_Functions_Group10 Bus Operation Function
  * @{
  */
hal_status_t HAL_USART_AcquireBus(hal_usart_handle_t *husart, uint32_t timeout_ms);
hal_status_t HAL_USART_ReleaseBus(hal_usart_handle_t *husart);
/**
  * @}
  */
#endif /* USE_HAL_MUTEX */

#if defined (USE_HAL_USART_USER_DATA) && (USE_HAL_USART_USER_DATA == 1)
/** @defgroup USART_Exported_Functions_Group11 User Data Functions
  * @{
  */
void HAL_USART_SetUserData(hal_usart_handle_t *husart, const void *p_user_data);
const void *HAL_USART_GetUserData(const hal_usart_handle_t *husart);
/**
  * @}
  */
#endif /* USE_HAL_USART_USER_DATA */

/** @defgroup USART_Exported_Functions_Group12 IRQ handling
  * @{
  */
void HAL_USART_IRQHandler(hal_usart_handle_t *husart);
/**
  * @}
  */

/** @defgroup USART_Exported_Functions_Group13 Default Callbacks
  * @{
  */

/* Default callback */
void HAL_USART_TxHalfCpltCallback(hal_usart_handle_t *husart);
void HAL_USART_TxCpltCallback(hal_usart_handle_t *husart);
void HAL_USART_RxHalfCpltCallback(hal_usart_handle_t *husart);
void HAL_USART_RxCpltCallback(hal_usart_handle_t *husart);
void HAL_USART_TxRxCpltCallback(hal_usart_handle_t *husart);

void HAL_USART_ErrorCallback(hal_usart_handle_t *husart);
void HAL_USART_AbortCpltCallback(hal_usart_handle_t *husart);

#if defined(USE_HAL_USART_FIFO) && (USE_HAL_USART_FIFO == 1)
void HAL_USART_RxFifoFullCallback(hal_usart_handle_t *husart);
void HAL_USART_TxFifoEmptyCallback(hal_usart_handle_t *husart);
#endif /* USE_HAL_USART_FIFO */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */
#endif /* USART1 || USART2 || USART3 || UART4 || UART5 || USART6 || UART7 */
/**
  * @}
  */
#ifdef __cplusplus
}
#endif

#endif /* STM32C5XX_HAL_USART_H */

